Revit 2026 API

# DetailElementOrderUtilsBringToFront(Document, View, ICollectionElementId) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static void BringToFront(
	Document document,
	View view,
	ICollection<ElementId> detailElementIds
)
```
```vb
Public Shared Sub BringToFront (
	document As Document,
	view As View,
	detailElementIds As ICollection(Of ElementId)
)
```
```cpp
public:
static void BringToFront(
	Document^ document,
	View^ view,
	ICollection<ElementId^>^ detailElementIds
)
```
```fsharp
static member BringToFront :
        document : Document *
        view : View *
        detailElementIds : ICollection<ElementId> -> unit
```

#### Parameters

document Document

view View

detailElementIds ICollectionElementId

#### Reference

DetailElementOrderUtils Class

BringToFront Overload

Autodesk.Revit.DB Namespace